; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Plant watering domain - metric-ff version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; An agent on a grid-like map aims pos watering some plants by
;;; carrying water from a tap to the plants.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Adapted to do away with the grid (Enrico Scala & Miquel Ramirez, August 2015)
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain mt-plant-watering-constrained)
    (:types
        thing location - object
        agent plant tap - thing
    )
    ; (:predicates
    ;    (CONNECTED ?x ?y - location) ;; Whether two locations are connected.
    ;)

    (:functions
        (maxx) ;; bounds
        (maxy) ;; bounds
        (miny) ;; bounds
        (minx) ;; bounds
        (x ?t - thing) ;; x coordinate of the location for ?t
        (y ?t - thing) ;; y coordinate of the location for ?t
        (carrying) ;; The amount of water carried by the agent.
        (poured ?p - plant) ;; The amount of water poured to the plant so far.
        (total_poured) ;; The total amount of water poured so far.
        (total_loaded) ;; The total amount of water retrieved from the tap.
        (max_int) ;; The maximum integer we consider - a static value
    )

    ;; Move an agent to a neighboring location
    (:action move_up
        :parameters (?a - agent)
        :precondition (and (<= (+ (y ?a) 1) (maxy)))
        :effect (and
            (increase (y ?a) 1))
    )

    (:action move_down
        :parameters (?a - agent)
        :precondition (and (>= (- (y ?a) 1) (miny)))
        :effect (and
            (decrease (y ?a) 1))
    )

    (:action move_right
        :parameters (?a - agent)
        :precondition (and (<= (+ (x ?a) 1) (maxx)))
        :effect (and
            (increase (x ?a) 1))
    )

    (:action move_left
        :parameters (?a - agent)
        :precondition (and (>= (- (x ?a) 1) (minx)))
        :effect (and
            (decrease (x ?a) 1))
    )

    (:action move_up_left
        :parameters (?a - agent)
        :precondition (and (>= (- (x ?a) 1) (minx)) (<= (+ (y ?a) 1) (maxy)))
        :effect (and
            (increase (y ?a) 1) (decrease (x ?a) 1))
    )

    (:action move_up_right
        :parameters (?a - agent)
        :precondition (and (<= (+ (x ?a) 1) (maxx)) (<= (+ (y ?a) 1) (maxy)))
        :effect (and
            (increase (y ?a) 1) (increase (x ?a) 1))
    )

    (:action move_down_left
        :parameters (?a - agent)
        :precondition (and (>= (- (x ?a) 1) (minx)) (>= (- (y ?a) 1) (miny)))
        :effect (and
            (decrease (x ?a) 1) (decrease (y ?a) 1))
    )

    (:action move_down_right
        :parameters (?a - agent)
        :precondition (and (<= (+ (x ?a) 1) (maxx)) (>= (- (y ?a) 1) (miny)))
        :effect (and
            (decrease (y ?a) 1) (increase (x ?a) 1))
    )

    ;; Load one unit of water from a tap into the agent's bucket.
    (:action load
        :parameters (?a - agent ?t - tap)
        :precondition (and (= (x ?a) (x ?t)) (=(y ?a) (y ?t))
            (<= (+ (total_loaded) 1) (max_int))
            (<= (+ (carrying) 1) (max_int))
        )
        :effect (and (increase (carrying) 1) (increase (total_loaded) 1))
    )

    ;; Pours one unit of water from the agent's bucket into a plant.
    (:action pour
        :parameters (?a - agent ?p - plant)
        :precondition (and (= (x ?a) (x ?p)) (=(y ?a) (y ?p))
            (>= (carrying) 1)
            (<= (+ (total_poured) 1) (max_int))
            (<= (+ (poured ?p) 1) (max_int))
        )
        :effect (and
            (decrease (carrying) 1)
            (increase (poured ?p) 1)
            (increase (total_poured) 1)
        )
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_1_3)
  (:domain mt-plant-watering-constrained)
  (:objects
    agent1 - agent
  tap1 - tap
  plant1 - plant
  )

  (:init
    (= (max_int) 20)
  (= (maxx) 7)
  (= (minx) 1)
  (= (maxy) 7)
  (= (miny) 1)
  (= (carrying) 0)
  (= (total_poured) 0)
  (= (total_loaded) 0)
  (= (poured plant1) 0)
  (= (x agent1) 7)
  (= (y agent1) 6)
  (= (x plant1) 1)
  (= (y plant1) 1)
  (= (x tap1) 6)
  (= (y tap1) 6)
  )

  (:goal (and
    (= (poured plant1) 9)
  (= (total_poured) (poured plant1) )
  ))





)

; plan
1. (move_left agent1)
   changed: (x agent1) from 7 to 6
   goals met: 1 of 2
2. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 0 to 1
   goals met: 1 of 2
3. (load agent1 tap1)
   changed: (carrying) from 1 to 2, (total_loaded) from 1 to 2
   goals met: 1 of 2
4. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
5. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
6. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
7. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
8. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
9. (pour agent1 plant1)
   changed: (carrying) from 2 to 1, (poured plant1) from 0 to 1, (total_poured) from 0 to 1
   goals met: 1 of 2
10. (move_up_right agent1)
   changed: (y agent1) from 1 to 2, (x agent1) from 1 to 2
   goals met: 1 of 2
11. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
12. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
13. (move_up_right agent1)
   changed: (y agent1) from 4 to 5, (x agent1) from 4 to 5
   goals met: 1 of 2
14. (move_up_right agent1)
   changed: (y agent1) from 5 to 6, (x agent1) from 5 to 6
   goals met: 1 of 2
15. (load agent1 tap1)
   changed: (carrying) from 1 to 2, (total_loaded) from 2 to 3
   goals met: 1 of 2
16. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
17. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
18. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
19. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
20. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
21. (pour agent1 plant1)
   changed: (carrying) from 2 to 1, (poured plant1) from 1 to 2, (total_poured) from 1 to 2
   goals met: 1 of 2
22. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 2 to 3, (total_poured) from 2 to 3
   goals met: 1 of 2
23. (move_up_right agent1)
   changed: (y agent1) from 1 to 2, (x agent1) from 1 to 2
   goals met: 1 of 2
24. (move_right agent1)
   changed: (x agent1) from 2 to 3
   goals met: 1 of 2
25. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 3 to 4
   goals met: 1 of 2
26. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 4 to 5
   goals met: 1 of 2
27. (move_up agent1)
   changed: (y agent1) from 4 to 5
   goals met: 1 of 2
28. (move_up_right agent1)
   changed: (y agent1) from 5 to 6, (x agent1) from 5 to 6
   goals met: 1 of 2
29. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 3 to 4
   goals met: 1 of 2
30. (load agent1 tap1)
   changed: (carrying) from 1 to 2, (total_loaded) from 4 to 5
   goals met: 1 of 2
31. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
32. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
33. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
34. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
35. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
36. (pour agent1 plant1)
   changed: (carrying) from 2 to 1, (poured plant1) from 3 to 4, (total_poured) from 3 to 4
   goals met: 1 of 2
37. (move_up_right agent1)
   changed: (y agent1) from 1 to 2, (x agent1) from 1 to 2
   goals met: 1 of 2
38. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
39. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
40. (move_up_right agent1)
   changed: (y agent1) from 4 to 5, (x agent1) from 4 to 5
   goals met: 1 of 2
41. (move_up_right agent1)
   changed: (y agent1) from 5 to 6, (x agent1) from 5 to 6
   goals met: 1 of 2
42. (load agent1 tap1)
   changed: (carrying) from 1 to 2, (total_loaded) from 5 to 6
   goals met: 1 of 2
43. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
44. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
45. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
46. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
47. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
48. (pour agent1 plant1)
   changed: (carrying) from 2 to 1, (poured plant1) from 4 to 5, (total_poured) from 4 to 5
   goals met: 1 of 2
49. (move_up_right agent1)
   changed: (y agent1) from 1 to 2, (x agent1) from 1 to 2
   goals met: 1 of 2
50. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
51. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
52. (move_up_right agent1)
   changed: (y agent1) from 4 to 5, (x agent1) from 4 to 5
   goals met: 1 of 2
53. (move_up_right agent1)
   changed: (y agent1) from 5 to 6, (x agent1) from 5 to 6
   goals met: 1 of 2
54. (load agent1 tap1)
   changed: (carrying) from 1 to 2, (total_loaded) from 6 to 7
   goals met: 1 of 2
55. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
56. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
57. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
58. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
59. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
60. (pour agent1 plant1)
   changed: (carrying) from 2 to 1, (poured plant1) from 5 to 6, (total_poured) from 5 to 6
   goals met: 1 of 2
61. (move_up_right agent1)
   changed: (y agent1) from 1 to 2, (x agent1) from 1 to 2
   goals met: 1 of 2
62. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 2 to 3
   goals met: 1 of 2
63. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 3 to 4
   goals met: 1 of 2
64. (move_up_right agent1)
   changed: (y agent1) from 4 to 5, (x agent1) from 4 to 5
   goals met: 1 of 2
65. (move_up_right agent1)
   changed: (y agent1) from 5 to 6, (x agent1) from 5 to 6
   goals met: 1 of 2
66. (load agent1 tap1)
   changed: (carrying) from 1 to 2, (total_loaded) from 7 to 8
   goals met: 1 of 2
67. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
68. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
69. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
70. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
71. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
72. (pour agent1 plant1)
   changed: (carrying) from 2 to 1, (poured plant1) from 6 to 7, (total_poured) from 6 to 7
   goals met: 1 of 2
73. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 7 to 8, (total_poured) from 7 to 8
   goals met: 1 of 2
74. (move_up agent1)
   changed: (y agent1) from 1 to 2
   goals met: 1 of 2
75. (move_up_right agent1)
   changed: (y agent1) from 2 to 3, (x agent1) from 1 to 2
   goals met: 1 of 2
76. (move_up_right agent1)
   changed: (y agent1) from 3 to 4, (x agent1) from 2 to 3
   goals met: 1 of 2
77. (move_up_right agent1)
   changed: (y agent1) from 4 to 5, (x agent1) from 3 to 4
   goals met: 1 of 2
78. (move_right agent1)
   changed: (x agent1) from 4 to 5
   goals met: 1 of 2
79. (move_up_right agent1)
   changed: (y agent1) from 5 to 6, (x agent1) from 5 to 6
   goals met: 1 of 2
80. (load agent1 tap1)
   changed: (carrying) from 0 to 1, (total_loaded) from 8 to 9
   goals met: 1 of 2
81. (move_down_left agent1)
   changed: (x agent1) from 6 to 5, (y agent1) from 6 to 5
   goals met: 1 of 2
82. (move_down_left agent1)
   changed: (x agent1) from 5 to 4, (y agent1) from 5 to 4
   goals met: 1 of 2
83. (move_down_left agent1)
   changed: (x agent1) from 4 to 3, (y agent1) from 4 to 3
   goals met: 1 of 2
84. (move_down_left agent1)
   changed: (x agent1) from 3 to 2, (y agent1) from 3 to 2
   goals met: 1 of 2
85. (move_down_left agent1)
   changed: (x agent1) from 2 to 1, (y agent1) from 2 to 1
   goals met: 1 of 2
86. (pour agent1 plant1)
   changed: (carrying) from 1 to 0, (poured plant1) from 8 to 9, (total_poured) from 8 to 9
   goals met: 2 of 2
